const data=[
    {  "S.no.":0,
      "Date": 1903,
      "Event": "Inspired by the writings of Jules Verne, first serious work published that showed physical space exploration was theoretically possible: The Exploration of Cosmic Space by Means of Reaction Devices",
      "Country": "Russia",
      "Name": "Konstantin Tsiolkovsky",
      "Summary": "In 1865, the French writer Jules Verne published his novel, From Earth to the Moon, followed five years later by its sequel, Round the Moon.Verne’s tale provides an uncannily prescient account of the development of space travel: Three astronauts blast off from Florida in a small aluminium capsule, fired from the end of an enormous cast-iron gun. After orbiting the moon and making observations with a pair of opera glasses, the three men return to Earth, splashing into the ocean as heroes.\n\nAlmost a century later, RKO Pictures would release a film inspired by Verne’s adventure story, while a comic book version of the tale went through multiple printings",
      "Imglink":"images/1900-1956/1.jpg"
    },
    {"S.no.":1,
      "Date": 1914,
      "Event": "Goddard files for and is subsequently awarded U.S. patents on multistage and liquid-fueled rockets",
      "Country": "United States",
      "Name": "Robert H. Goddard",
      "Summary": "Dr. Robert Hutchings Goddard (1882-1945) is considered the father of modern rocket propulsion. A physicist of great insight, Goddard also had a unique genius for invention. It is in memory of this brilliant scientist that NASA’s Goddard Space Flight Center in Greenbelt, Maryland, was established on May 1, 1959.By 1926, Goddard had constructed and successfully tested the first rocket using liquid fuel. Indeed, the flight of Goddard’s rocket on March 16, 1926, at Auburn, Massachusetts, was as significant to history as that of the Wright brothers at Kitty Hawk.In 1914, Goddard received two U.S. patents,one of which was for a rocket using liquid fuel.",
      "Imglink":"images/1900-1956/2.jpg"
    },
    {"S.no.":2,
      "Date": 1917,
      "Event": "First observation of an extrasolar planet (exoplanet) round Van Maanen 2 although it is not recognised as such at the time.",
      "Country": "Netherlands",
      "Name": "Adriaan van Maanen",
      "Summary": "The first evidence of a possible exoplanet, orbiting Van Maanen 2, was noted in 1917, but was not recognized as such. The astronomer Walter Sydney Adams, who later became director of the Mount Wilson Observatory, produced a spectrum of the star using Mount Wilson's 60-inch telescope. He interpreted the spectrum to be of an F-type main-sequence star, but it is now thought that such a spectrum could be caused by the residue of a nearby exoplanet that had been pulverized into dust by the gravity of the star, the resulting dust then falling onto the star.",
      "Imglink":"images/1900-1956/3.jpg"
    },
    {"S.no.":3,
      "Date": 1919,
      "Event": "Goddard's widely influential paper A Method of Reaching Extreme Altitudes discussed solid- and liquid-fueled rocketry",
      "Country": "United States",
      "Name": "Robert H. Goddard",
      "Summary": "In 1919 Goddard thought that it would be premature to disclose the results of his experiments because his engine was not sufficiently developed. Dr. Webster realized that Goddard had accomplished a good deal of fine work and insisted that Goddard publish his progress so far or he would take care of it himself, so Goddard asked the Smithsonian Institution if it would publish the report, updated with notes, that he had submitted in late 1916.In late 1919, the Smithsonian published Goddard's groundbreaking work, A Method of Reaching Extreme Altitudes. The report describes Goddard's mathematical theories of rocket flight, his experiments with solid-fuel rockets, and the possibilities he saw of exploring Earth's atmosphere and beyond.",
      "Imglink":"images/1900-1956/4.jpg"   
    },
    {"S.no.":4,
      "Date": "15-Dec-23",
      "Event": "Die Rakete zu den Planetenrium By Rocket into Planetary Space self-published after its rejection as a doctoral thesis.",
      "Country": "Germany",
      "Name": "Hermann Oberth",
      "Summary": "In 1919, Oberth once again moved to Germany, this time to study physics, initially in Munich and later at the University of Göttingen.\n\nIn 1922, Oberth's proposed doctoral dissertation on rocket science was rejected as\"utopian\". However, professor Augustin Maior of the University of Cluj, Romania offered Oberth to defend his original dissertation there in order to receive the doctorate degree. He did successfully on 23 May 1923.He next had his 92-page work published privately in June 1923 as the somewhat controversial book, \"The Rocket into Planetary Space\". By 1929, Oberth had expanded this work to a 429-page book titled \"Ways to Spaceflight\". Oberth commented later that he made the deliberate choice not to write another doctoral dissertation.",
      "Imglink":"images/1900-1956/5.jpg"
    },
    {"S.no.":5,
      "Date": 1924,
      "Event": "Society for Studies of Interplanetary Travel founded",
      "Country": "USSR",
      "Name": "Members include Konstantin Tsiolkovsky, Friedrich Zander, Yuri Kondratyuk",
      "Summary": "The Society for Studies of Interplanetary Travel was founded in Moscow in May 1924. It was a spin-off of a military science society at the Zhukovsky Airforce Academy, and was chaired by Grigory Kramarov. Its 200 charter members included important Soviet space-exploration and rocketry experts such as Konstantin Tsiolkovsky, Fridrikh Tsander, and Vladimir Vetchinkin. The society allowed engineers and educators to meet and discuss space travel, and it organized public educational events.\n\nOIMS hosted a famous public debate on October 4, 1924 to discuss the idea of Robert Goddard to launch a rocket to the Moon.\n\nThe society existed for only about one year.",
      "Imglink":"images/1900-1956/6.jpg"
    },
    {"S.no.":6,
      "Date": "16-Mar-26",
      "Event": "Goddard launches the first liquid-fueled rocket",
      "Country": "United States",
      "Name": "Robert H. Goddard",
      "Summary": "Goddard dreamt of exploring the Earth’s upper atmosphere and, ultimately, space using rocket propulsion. Although his work was revolutionary, he received little public support for his research. Following his theoretical work on the physics of rocketry, he began experimenting with different rocket engines. Believing that liquid propellants offered the most promise, he successfully launched the first liquid-fueled rocket on March 16, 1926, on a farm in Auburn, Massachusetts.",
      "Imglink":"images/1900-1956/7.jpg"
    },
    {"S.no.":7,
      "Date": 1927,
      "Event": "Society for Space Travel formed; it includes many top European rocket scientists.",
      "Country": "Germany",
      "Name": "Many European rocket scientists",
      "Summary": "The Verein für Raumschiffahrt (VfR, English: Society for Space Travel) was a German amateur rocket association prior to World War II that included members outside Germany.The first successful VfR test firing with liquid fuel (five minutes) was conducted by Max Valier at the Heylandt Works on January 25, 1930; and additional rocket experiments were conducted at a farm near Bernstadt, Saxony.Space travel and rocketry gained popularity in Germany after the June 1923 publication of Herman Oberth's book Die Rakete zu den Planetenräumen (English: The Rocket into Planetary Space) and the expanded 1929 work Wege zur Raumschiffahrt (Ways to Spaceflight).The VfR was founded in 1927 by Johannes Winkler, with Max Valier and Willy Ley after their participation as expert advisers for Fritz Lang's early science fiction film Frau im Mond (The Woman in the Moon). Ley and Hermann Oberth had hoped to receive funding from Lang for a real-life experimental rocket launch coinciding with the movie's premiere.Valier had assisted in Fritz von Opel's rocket-powered publicity stunts for the Opel company.",
      "Imglink":"images/1900-1956/8.jpg"
    },
    {"S.no.":8,
      "Date": 1927,
      "Event": "The Conquest of Interplanetary Space) discusses rocket mechanics and orbital effects including the gravitational slingshot",
      "Country": "USSR",
      "Name": "Yuri Kondratyuk",
      "Summary": "The Conquest of Interplanetary Spaces is a science book by Soviet engineer and mathematician Yuri Kondratyuk published in 1929, significant for being one of the first documented proposals for lunar orbit rendezvous.The Conquest of Interplanetary Space was published in Novosibirsk. Yuri Kondratyuk paid the Siberian Union Printing Shop. Conquest of interplanetary space was important, for it outlined how a rocket could leave Earth and fly into space, the use of decaying atomic matter as a power source for propulsion etc.It issued 2,000 copies of the book.",
      "Imglink":"images/1900-1956/9.jpg"
    },
    {"S.no.":9,
      "Date": 1928,
      "Event": "Das Problem der Befahrung des Weltraums--der Raketen-Motor (The Problem of Space Travel-The Rocket Motor) discusses space travel and its potential uses for scientific",
      "Country": "Germany",
      "Name": "Herman Potocnik",
      "Summary": "In 1929, an Austro-Hungarian - Slovene called Herman Potocnik published a book under the pseudonym of ‘Noordung’. The book was Das Problem der Befahrung des Weltraums (The Problem of Space Travel). It was the first book to devote most of its pages to space stations. Noordung proposed the Wohnrad (inhabitable wheel) design. This strongly influenced the work of technicians and Names, as well as of science fiction authors. It inspired many space station designs during the 1950s, even the one appearing in 2001 - A Space Odyssey. ",
      "Imglink":"images/1900-1956/10.jpg"
    },
    {"S.no.":10,
      "Date": "11-Jun-28",
      "Event": "Lippisch Ente, first successful rocket-powered full-size aircraft",
      "Country": "Germany",
      "Name": "Alexander Lippisch (designer), Fritz Stamer (pilot)",
      "Summary": "Enter the Duck,After testing out a Lippisch model, von Opel and his associates in June 1928 purchased a full-size Lippisch aircraft, the Ente (Duck). The group selected one of Lippisch’s test pilots, Fritz Stamer, to fly it.With a wingspan of just under 40 feet, and a length of some 14 feet, the Ente featured a canoe-like fuselage, canard surfaces, and rudders mounted outboard on a straight rectangular wing. Each of the aircraft’s two 44-pound-thrust rocket engines were tightly packed with about eight pounds of black powder. They were at the top of the rear end of the fuselage.Designed to fire in sequence, the rockets were ignited electrically by the pilot. An automatic counterweight system was set to adjust the aircraft’s center of gravity as the rocket fuel was consumed. An elastic launching rope was used to catapult the Ente into the air.The first test of the Ente came on June 11, 1928. It was a failure; the glider did not become airborne and the rocket simply fizzled out.A second launch that day, however, was successful. After being slung into the air, Stamer reported, he ignited one rocket and heard it hiss threateningly behind him. When the first rocket burned out, he ignited the next. In such a way he was able to fly a complete circle of about 4,900 feet in circumference, landing just as the rocket thrust expired.",
      "Imglink":"images/1900-1956/11.jpg"
    },
    {"S.no.":11,
      "Date": "20-Jun-44",
      "Event": "V-2 Rocket (MW 18014): First artificial object to cross what would later be defined as the Karmaan line and hence first spaceflight in",
      "Country": "Germany",
      "Name": "Wehrmacht",
      "Summary": "MW 18014 was a German A-4/V-2 rocket[nb 1] test launch that took place on 20 June 1944,at the Peenemünde Army Research Center in Peenemünde. It was the first man-made object to reach outer space, attaining an apogee of 176 kilometers, which is above the Kármán line.It was a vertical test launch. Although the rocket reached space, it did not reach orbital velocity, and therefore returned to Earth in an impact, becoming the first sub-orbital spaceflight, depending on definition.",
      "Imglink":"images/1900-1956/12.jpg"
    },
    {"S.no.":12,
      "Date": "Oct-45",
      "Event": "Article in Wireless World, Extra-Terrestrial Relays - Can Rocket Stations Give Worldwide Radio Coverage makes first discussion of geostationary satellites as a means of communication.",
      "Country": "UK",
      "Name": "Arthur C. Clarke",
      "Summary": "Extra-terrestrial relays: can rocket stations give worldwide radio coverage? Wireless World, pp. 305 – 308. A landmark paper that first described using three GEO satellites to provide worldwide communication coverage",
      "Imglink":"images/1900-1956/13.jpg"
    },
    {"S.no.":13,
      "Date": "10-May-46",
      "Event": "First space research flight (cosmic radiation experiments)",
      "Country": "United States",
      "Name": "captured and improved V-2 rocket",
      "Summary": "Scientists invented early space instruments from scratch - improvising from other fields as they went along. Van Allen and his graduate students cobbled together cosmic ray detectors with miniaturized parts meant for watches, hearing aids, nuclear research and the latest rage – transistor radios.The machine shop in the physics building fabricated other parts non-stop. Harried graduate students rushing in to buy wire or miniscule screws for instruments became a familiar sight at Iowa City hardware stores.",
      "Imglink":"images/1900-1956/14.jpg"
    },
    {"S.no.":14,
      "Date": "24-Oct-46",
      "Event": "First pictures of Earth from 105km (65mi",
      "Country": "United States",
      "Name": "V-2",
      "Summary": "It was captured on 24 October 1946 from a rocket 105 km above the ground that had been launched from the White Sands Missile Range in New Mexico, USA.The rocket was a German V2, captured by the Americans at the end of World War II. Hundreds of scientists and engineers from the Nazi rocket program were vital to the postwar development of the American and Russian space programs.Though the V2 had rained terror on London and other cities during the war, in peacetime the explosive warhead was removed and replaced with a package of scientific instruments. These included a 35mm motion-picture camera set to snap one picture every second and a half.The resulting images, developed from film dropped back to Earth in a tough steel canister, were like nothing that had been seen before. Until this point, the highest vantage point from which photos had been taken was some 22 km, aboard a high-altitude balloon.",
      "Imglink":"images/1900-1956/15.jpg"
    },
    {"S.no.":15,
      "Date": "20-Feb-47",
      "Event": "First animals in space (fruit flies)",
      "Country": "United States",
      "Name": "V-2",
      "Summary": "While many flights into space may have accidentally carried bacteria and other forms of life on board, the first living creatures intentionally sent into space were fruit flies. These were transported aboard a V2 rocket on 20 February 1947.The fruit flies were launched from White Sands Missile Range in New Mexico as part of a research mission. The unnamed rocket travelled 67 miles into the air before parachuting back to Earth. NASA currently recognises the altitude of 66 miles (100km) as the point where space officially begins. Therefore, the fruit flies are considered the first animals ever to reach the final frontier.",
      "Imglink":"images/1900-1956/16.jpg"
    },
    {"S.no.":16,
      "Date": "24-Feb-49",
      "Event": "WAC Corporal missile mounted onto a V-2 rocket, producing the first two-stage liquid-fueled rocket, that sets a record altitude of 244 miles (392.68 kilometers).",
      "Country": "United States",
      "Name": "Bumper-5",
      "Summary": "Six Bumper launches were made from White Sands Proving Grounds. The first four, launched in 1947/48 were test flights of varying degrees of success.The first fully successful Bumper flight was the fifth in the series, launched at 3:14 P.M. (MST), February 24, 1949.Bumper 5 was the first in the Bumper series to be launched with a fully fueled second stage.One minute after blast-off, at an altitude of 20 mi (32 km) and a speed of just under 1 mi (1.6 km) per second, the WAC Corporal detached from the V-2 first stage and fired its own engine. Forty seconds later, at second stage Brennschluss, the WAC Corporal had reached its maximum speed of 1.39 mi (2.24 km) per second.It reached its peak altitude of 250 mi (400 km), a world record,six and a half minutes after launch.The V-2 first stage crashed into the New Mexico desert five minutes after launch 20 mi (32 km) north of its firing site. The WAC Corporal hit the ground 12 minutes after take-off 80 mi (130 km) from its launch pad. So great was its velocity upon impact, higher than any rocket to date, that the wreck was not found for analysis until January 1950",
      "Imglink":"images/1900-1956/17.jpg"
    },
    {"S.no.":17,
      "Date": "20-Sep-56",
      "Event": "The first rocket to pass the Thermopause and enter the Exosphere. At 682 miles (1,097.57 km) altitude and 3,335 miles range, the 3-stage Jupiter-C breaks both records and achieves MACH 18 velocity.",
      "Country": "United States",
      "Name": "Jupiter-C (first launch)",
      "Summary": "The first launch of the Jupiter C went off without a hitch on September 20, 1956. The inert fourth stage and its dummy satellite payload reached a record peak altitude of 1,097 kilometers (682 miles) and landed 5,366 kilometers (3,335 miles) downrange in the Atlantic Ocean. The principle objectives of the flight were met and the beacon on the simulated satellite payload was tracked throughout the flight. Von Braun and his team had demonstrated that they had the means of launching a satellite into orbit.On May 15, 1957, the second Jupiter C, which was the first to carry a scaled Jupiter IRBM nosecone payload, successfully lifted off. Although the rocket operated as intended, a guidance system malfunction caused the nosecone to overshoot the target area and the payload was not recovered. Radar tracking, however, indicated that the test vehicle’s ablative heat shield worked as intended and that the nosecone survived reentry. The third flight of the Jupiter C took place on August 8, 1957. The nosecone was quickly recovered and within days presented by President Eisenhower on national television as the first object to be successfully recovered from space. With this successful third flight, the Jupiter C program had met all of its objectives and the program was declared completed. The remaining Jupiter C rockets were placed into storage in hopes of using them to launch a satellite.",
      "Imglink":"images/1900-1956/18.jpg"
    }
  ];