const data=[{
    "Date": "March 1960",
    "Event": "First solar probe.",
    "Country": " USA (NASA)",
    "Name": "Pioneer 5",
    "Summary": "The Pioneer 5 was launched on 11 March, 1960 from Cape Canaveral Air Force Station. The probe confirmed the existence of interplanetary magnetic fields between Earth and Venus, and is touted as the most successful mission in the Pioneer series. Pioneer 5 carried Telebit, the first digital telemetry system operationally used on a U.S. spacecraft. It was first tested on Explorer 6. The system used a 5-watt or a 150-watt transmitter, with a 5-watt transmitter acting as driver. Information rates varied from 1 to 64 bits per second.",
    "Imglink": "images/1960-1969/Pioneer5.jpg"
},
{
    "Date": "19 August 1960",
    "Event": "First plants and animals to return alive from Earth orbit",
    "Country": " USSR",
    "Name": "Sputnik 5",
    "Summary": "Sputnik 5 was launched on 19 August 1960 at 8:38 UT from Baikonur Cosmodrome. This spacecraft was the second in a series of spacecraft designed to further the development of an Earth orbiting system for the planned manned space program. The spacecraft carried two dogs, Strelka (pictured) and Belka, in addition to a television system and other scientific instrumentation. After a one day flight, the spacecraft and both dogs were successfully recovered.",
    "Imglink": "images/1960-1969/Sputnik5.jpg"
},
{
    "Date": "10 October 1960",
    "Event": "First probe launched to Mars (failed to reach target)",
    "Country": " USSR",
    "Name": "Mars 1M",
    "Summary": "The objectives of the mission were to investigate interplanetary space between Earth and Mars, to study Mars and return surface images from a flyby trajectory, and to study the effects of extended spaceflight on onboard instruments and provide radio communications from long distances. After launch, the third stage pumps were unable to develop enough thrust to commence ignition, so Earth parking orbit was not achieved. The spacecraft reached an altitude of 120 km before reentry. ",
    "Imglink": "images/1960-1969/Mars1M.jpg"
},
{
    "Date": "31 January 1961",
    "Event": "First Hominidae in space, first tasks performed in space; Ham (chimpanzee).",
    "Country": " USA (NASA)",
    "Name": "Mercury Redstone 2",
    "Summary": "It was the first flight to carry a member of the Hominid species into space. Ham the chimpanzee was sent aboard this mission before actual humans were sent into space. Ham performed his tasks well, pushing levers about 50 times during the flight. Onboard cameras filming Ham's reaction to weightlessness showed a surprising amount of dust and debris floating around inside the capsule during apogee. Ham was successfully recovered after the capsule carrying him landed in the Pacific Ocean.",
    "Imglink": "images/1960-1969/MercuryRedstone2.jpg"
},
{
    "Date": "12 February 1961",
    "Event": "First launch from Earth orbit of upper stage into a heliocentric orbit. First mid-course corrections First spin-stabilisation",
    "Country": " USSR",
    "Name": "Luna 1",
    "Summary": "Luna 1 was the first spacecraft to reach the Moon, and the first of a series of Soviet automatic interplanetary stations successfully launched in the direction of the Moon. The primary objectives of the mission were to measure temperature and pressure inside the vehicle; study the gas components of interplanetary matter and corpuscular radiation of the Sun; measure the magnetic fields of the Earth and moon; study meteoric particles in space; study the distribution of heavy nuclei in primary cosmic radiation; and study other properties of cosmic rays. ",
    "Imglink" : "images/1960-1969/Luna1.jpg"
},
{
    "Date": "12 April 1961",
    "Event": "First human spaceflight (Yuri Gagarin)First human-crewed orbital flight",
    "Country": " USSR",
    "Name": "Vostok 1",
    "Summary": "Vostok 1 was the first spacecraft to carry a human, Yuri A. Gagarin, into space, occurring 25 days prior to the first U.S. suborbital flight. Because of concerns of adverse reactions to due to experiencing weightlessness, the manual controls on the spacecraft were locked prior to launch and the entire flight was under the control of ground personnel. After one orbit, the spacecraft reentered the atmosphere and landed in Kazakhstan (about 26 km southwest of Engels) 1 hour 48 minutes after launch. The Vostok spacecraft was designed to eject the cosmonaut at approximately 7 km and allow him to return to earth by parachute. Although initial reports made it unclear whether Gagarin landed in this manner or returned in the spacecraft, subsequent reports confirmed that he did indeed eject from the capsule.",
    "Imglink": "images/1960-1969/Vostok1.jpg"    },
{
    "Date": "5 May 1961",
    "Event": "First human-piloted space flight (Alan Shepard)First human-crewed suborbital flightFirst human space mission that landed with pilot still in spacecraft, thus the first complete human spaceflight by FAI definitions.",
    "Country": " USA",
    "Name": "Freedom 7",
    "Summary": "Mercury-Redstone 3, or Freedom 7, was the first United States human spaceflight, on May 5, 1961, piloted by astronaut Alan Shepard. It was the first crewed flight of Project Mercury. The project had the ultimate objective of putting an astronaut into orbit around the Earth and return him safely. Shepard's mission was a 15-minute suborbital flight with the primary objective of demonstrating his ability to withstand the high g-forces of launch and atmospheric re-entry. ",
    "Imglink": "images/1960-1969/Freedom7.jpg"    },
{
    "Date": "19 May 1961",
    "Event": "First planetary flyby (within 100,000Â km of Venus)",
    "Country": " USSR",
    "Name": "Venera 1",
    "Summary": "Venera 1 (Automatic Interplanetary Station) was the first spacecraft to fly by Venus. Venera 1 was launched on 12 February 1961 along with an Earth orbiting launch platform (Tyazheliy Sputnik 5, also called Sputnik 8 (1961-003C)) with a SL-6/A-2-e launcher. Venera-1 had a dome which contained a sphere pressurized at 1.2 atm., which carried a Soviet pennant and was designed to float on the putative Venus oceans after the intended Venus impact. Venera 1 had an on-board mid-course correction engine (although this was not labelled in diagrams of the spacecraft). Temperature control, nominally 30 C, was achieved with thermal shutters. Attitude control was achieved through the use of Sun and star sensors, gyroscopes, and nitrogen gas jets",
    "Imglink" : "images/1960-1969/Venera1.jpg"
},
{
    "Date": "6 August 1961",
    "Event": "First crewed space flight lasting over twenty four hours by Gherman Titov, who is also the first to suffer from space sickness.",
    "Country": " USSR",
    "Name": "Vostok 2",
    "Summary": "Vostok 2, the second spacecraft in the U.S.S.R.'s manned flight series, was piloted by cosmonaut German S Titov. The spacecraft consisted of a nearly spherical cabin covered with ablative material. There were three small portholes and external radio antennas. Radios, a life support system, instrumentation, and an ejection seat were contained in the manned cabin. This cabin was attached to a service module that carried chemical batteries, orientation rockets, the main retro system, and added support equipment for the total system. ",
    "Imglink": "images/1960-1969/Vostok2.jpg"
},
{
    "Date": "7 March 1962",
    "Event": "First orbital solar observatory",
    "Country": " USA (NASA)",
    "Name": "OSO-1",
    "Summary": "The objectives of the OSO satellite series were to perform solar physics experiments above the atmosphere during a complete solar cycle and to map the celestial sphere for direction and intensity of UV light, X-rays, and gamma radiation. The OSO 1 was the first satellite to have pointed instruments and onboard tape recorders for data storage. The OSO 1 platform consisted of a sail section, which pointed two experiments continuously toward the sun, supplying power to the experiments from the solar batteries and rechargeable chemical batteries; and a wheel section, which spun about an axis perpendicular to the pointing direction of the sail and carried seven experiments.",
    "Imglink": "images/1960-1969/Oso1.jpg"
},
{
    "Date": "26 April 1962",
    "Event": "First spacecraft to impact the far side of the Moon",
    "Country": " USA (NASA)",
    "Name": "Ranger 4",
    "Summary": "The Ranger 4 spacecraft, which was designed to collect data on interplanetary space, photograph the moon up close and make a rough landing on the lunar surface, was the first American spacecraft to reach another celestial body. It was designed to transmit pictures during descent and to rough-land a capsule carrying a seismometer and other instruments. A computer problem prevented it from performing any operations. It impacted the Moon’s far side.",
    "Imglink": "images/1960-1969/Ranger4.jpg"
},
{
    "Date": "11 August 1962",
    "Event": "First dual crewed spaceflightFirst communication between two crewed space vehicles in orbit.",
    "Country": " USSR",
    "Name": "Vostok 3 & Vostok 4",
    "Summary": "Vostok 4 was launched one day after Vostok 3 with cosmonaut Pavel R. Popovich on board. The spacecraft consisted of a nearly spherical cabin covered with ablative material. There were three small portholes and external radio antennas. Radios, a life support system, instrumentation, and an ejection seat were contained in the manned cabin. This cabin was attached to a service module that carried chemical batteries, orientation rockets, the main retro system, and added support equipment for the total system. This module was separated from the manned cabin on reentry. The flight lasted 70.7 hr, and was in an orbit close to Vostok 3. Minimum distance between the two spacecraft was approximately 5 km. Radio communications were maintained between the two spacecraft and earth during this flight. For the first time, TV pictures were transmitted from the spacecraft and broadcast by the Soviet TV system.",
    "Imglink": "images/1960-1969/Vostok34.jpg"
},
{
    "Date": "18 August 1962",
    "Event": "First auroral research rocket launched into the ionosphere",
    "Country": " Norway",
    "Name": "Ferdinand 1",
    "Summary": "Ferdinand-1 was a NIKE-Cajun two-stage rocket that carried two instruments in its payload. The purpose of the launch was to do measurements in the ionosphere, where charged particles from the sun ionize the atoms. The process is most intense in the polar ionosphere, and is important not only for the Northern Lights, but also for long-range radio communication, because the free electrons reflect the radio waves. The goal was to explore the possibility of improving long-range radio communication. ",
    "Imglink": "images/1960-1969/Ferdinand1.jpg"
},
{
    "Date": "November 1962",
    "Event": "First Mars flyby (11,000Â km) but contact was lost",
    "Country": " USSR",
    "Name": "Mars 1",
    "Summary": "Mars 1 was the first spacecraft to fly by Mars, although communications had been lost before it reached the planet. It was an automatic interplanetary station launched with the intent of flying by Mars at a distance of about 11,000 km. It was designed to image the surface and send back data on cosmic radiation, micrometeoroid impacts and Mars' magnetic field, radiation environment, atmospheric structure, and possible organic compounds",
    "Imglink": "images/1960-1969/Mars1.jpg"    },
{
    "Date": "14 December 1962",
    "Event": "First successful planetary flyby (Venus closest approach 34,773 kilometers)",
    "Country": " USA (NASA)",
    "Name": "Mariner 2",
    "Summary": "The Mariner 2 spacecraft was the second of a series of spacecraft used for planetary exploration in the flyby, or nonlanding, mode and the first spacecraft to successfully encounter another planet. Mariner 2 was a backup for the Mariner 1 mission which failed shortly after launch to Venus. The objective of the Mariner 2 mission was to fly by Venus and return data on the planet's atmosphere, magnetic field, charged particle environment, and mass. It also made measurements of the interplanetary medium during its cruise to Venus and after the flyby. ",
    "Imglink": "images/1960-1969/Mariner2.jpg"    },
{
    "Date": "16 June 1963",
    "Event": "First woman in space (Valentina Tereshkova)",
    "Country": " USSR",
    "Name": "Vostok 6",
    "Summary": "Vostok 6, the last spacecraft in the USSRs first manned flight series, carried Valentina V. Tereshkova, the first woman in space. The spacecraft consisted of a nearly spherical cabin covered with ablative material. There were three small portholes and external radio antennas. Radios, a life support system, instrumentation, and an ejection seat were contained in the manned cabin. This cabin was attached to a service module that carried chemical batteries, orientation rockets, the main retro system, and added support equipment for the total system. This module was separated from the manned cabin on reentry. This flight lasted for 3 days and, for most of this time, Vostok 6 flew with Vostok 5 maintaining two-way radio communications and establishing communications with earth at regular intervals. TV pictures of the cosmonauts in their cabins were relayed to earth, and a series of biomedical and scientific experiments were conducted",
    "Imglink": "images/1960-1969/Vostok6.jpg"    },
{
    "Date": "19 July 1963",
    "Event": "First reusable crewed spacecraft (suborbital)",
    "Country": " USA (NASA)",
    "Name": "X-15 Flight 90",
    "Summary": "Flight 90 of the North American X-15 was a research flight conducted by NASA and the US Air Force in 1963. It was the first of two X-15 missions that passed the 100-km high Kármán line, the FAI definition of space, along with Flight 91 the next month. The X-15 was flown by Joseph A. Walker, who flew both X-15 spaceflights. Maximum Speed - 5,971 km/h. Maximum Altitude - 106,010 m. 80 cm diameter balloon towed on 30 m line to measure air density. First X-15 flight over 100 km (a height known as the Kármán line). This made Walker the first US civilian in space.[1] This was also the first spaceflight of a spaceplane in aviation history. First flight launched over Smith Dry Lake, NV. Experiments: Towed balloon, horizon scanner, photometer, infrared and ultraviolet. Balloon instrumentation failed. ",
    "Imglink": "images/1960-1969/X15Flight90.jpg"    },
{
    "Date": "12 October 1964",
    "Event": "First multi-person crew (3) in orbit",
    "Country": " USSR",
    "Name": "Voskhod 1",
    "Summary": "The U.S.S.R. launched the world's first multi-manned spacecraft, Voskhod I, the first to carry a scientist and a physician into space. The crew were Col. Vladimir Komarov, pilot; Konstantin Feoktistov, scientist; and Boris Yegorov, physician. Coming before the two-man Gemini flights, Voskhod 1 had a significant worldwide impact. In the United States, the \"space race\" was again running under the green flag. NASA Administrator James E. Webb, commenting on the spectacular, called it a \"significant space accomplishment.\" It was, he said, \"a clear indication that the Russians are continuing a large space program for the achievement of national power and prestige.\"",
    "Imglink": "images/1960-1969/Voskhod1.jpg"
    },
{
    "Date": "18 March 1965",
    "Event": "First space walk/extra-vehicular activity (Alexei Leonov)",
    "Country": " USSR",
    "Name": "Voskhod 2",
    "Summary": "Voskhod 2 was launched with two men on board, cosmonauts Pavel I. Belyayev, pilot, and Aleksey A. Leonov, co-pilot. The spacecraft was equipped with an extendable air lock that permitted Leonov's exit into space without having to evacuate the main cabin air. Leonov was the first man to perform an EVA (ExtraVehicular Activity) in space. For this EVA a space suit was donned, and a life-support system was worn in a back pack. The EVA was recorded by a mounted extended TV camera",
    "Imglink": "images/1960-1969/Voskhod2.jpg"    },
{
    "Date": "March 1965",
    "Event": "First crewed spacecraft to change orbit",
    "Country": " USA (NASA)",
    "Name": "Gemini 3",
    "Summary": "Gemini 3 was the first crewed Earth-orbiting spacecraft of the Gemini series. It was piloted by astronauts Virgil \"Gus\" Grissom and John Young, with the primary objective of demonstrating the crewed qualifications of the Gemini spacecraft including evaluation of the two-man Gemini design, the worldwide tracking network, the orbit attitude and maneuver system (OAMS), the control of reentry flight path and landing point, spacecraft systems, and spacecraft recovery. Secondary objectives included evaluation of flight crew equipment and effects of low level launch vehicle oscillations (POGO) on the crew, performance of three experimants, and to obtain photographic coverage from orbit.",
    "Imglink": "images/1960-1969/Gemini3.jpg"    },
{
    "Date": "14 July 1965",
    "Event": "First Mars flyby (closest approach 9,846 kilometers; returned pictures)",
    "Country": " USA (NASA)",
    "Name": "Mariner 4",
    "Summary": "Mariner 4 was the fourth in a series of spacecraft used for planetary exploration in a flyby mode and represented the first successful flyby of the planet Mars, returning the first pictures of the martian surface. These represented the first images of another planet ever returned from deep space. Mariner 4 was designed to conduct closeup scientific observations of Mars and to transmit these observations to Earth. Other mission objectives were to perform field and particle measurements in interplanetary space in the vicinity of Mars and to provide experience in and knowledge of the engineering capabilities for interplanetary flights of long duration",
    "Imglink": "images/1960-1969/Mariner4.jpg"    },
{
    "Date": "15 December 1965",
    "Event": "First orbital rendezvous (parallel flight, no docking)",
    "Country": " USA (NASA)",
    "Name": "Gemini 6A/Gemini 7",
    "Summary": "Gemini 6A was the fifth crewed Earth-orbiting spacecraft of the Gemini series, having been launched after Gemini 7, with the intent of making rendezvous with Gemini 7 in Earth orbit. The astronauts on the 26 hour mission were Walter Schirra and Thomas Stafford. The mission priorities were to demonstrate on-time launch procedures, closed-loop rendezvous capabilities, and stationkeeping techniques with Gemini 7. Other objectives were to evaluate the spacecraft reentry guidance capabilities, and conduct spacecraft systems tests and four experiments. This mission was originally designated Gemini 6 and scheduled for launch on 25 October but was cancelled when the Agena target vehicle failed to go into orbit an hour earlier",
    "Imglink": "images/1960-1969/Gemini6A7.jpg"    },
{
    "Date": "3 February 1966",
    "Event": "First soft landing on another world (the Moon) First photos from another world",
    "Country": " USSR",
    "Name": "Luna 9",
    "Summary": "Luna 9 was the first spacecraft to achieve a lunar soft landing and to transmit photographic data from the Moon's surface to Earth, preceding the U.S. Surveyor 1 soft lander by about 4 months. The probe also proved that the lunar surface could support the weight of a lander and that an object would not sink into a loose layer of dust as some models predicted. Luna 9 launched on 31 January 1966 at 11:41 UT (14:41 Moscow time) from Baikonur Cosmodrome and reached the Moon on 3 February.",
    "Imglink": "images/1960-1969/Luna9.jpg"    },
{
    "Date": "1 March 1966",
    "Event": "First impact into another planet (Venus)",
    "Country": " USSR",
    "Name": "Venera 3",
    "Summary": "Venera 3 was launched from a Tyazheliy Sputnik (65-092B) towards the planet Venus. The mission of this spacecraft was to land on the Venusian surface. The entry body contained a radio communication system, scientific instruments, electrical power sources, and medallions bearing the coat of arms of the U.S.S.R. The station impacted Venus on March 1, 1966, making Venera 3 the first spacecraft to impact on the surface of another planet. However, the communications systems had failed on 16 February, before planetary data could be returned.",
    "Imglink": "images/1960-1969/Venera3.jpg"    },
{
    "Date": "16 March 1966",
    "Event": "First orbital docking between two spacecraft",
    "Country": " USA (NASA)",
    "Name": "Gemini 8/Agena target vehicle",
    "Summary": "Gemini 8 was the sixth crewed Earth-orbiting spacecraft of the Gemini series, carrying astronauts Neil Armstrong and David Scott. The primary mission objectives were to perform rendezvous and four docking tests with the Agena target vehicle and to execute an ExtraVehicular Activity (EVA) experiment. Other objectives included parking the Agena in a 410 km circular orbit, performing a rerendezvous with the Agena, conduct systems evaluation, evaluating the auxiliary tape memory unit, and demonstration of controlled reentry. Ten technological, medical, and scientific experiments were carried on board. ",
    "Imglink": "images/1960-1969/Gemini8.jpg"    },
{
    "Date": "3 April 1966",
    "Event": "First artificial satellite around another world (the Moon)",
    "Country": " USSR",
    "Name": "Luna 10",
    "Summary": "Luna 10 was the first spacecraft to go into orbit around the Moon, and the first human-made object to orbit any body beyond the Earth. The primary objectives were to achieve the first lunar orbit, gain experience in orbital operations, presumably as a precursor to astronaut orbital missions, and study the lunar environment. The launch was timed so that the spacecraft would come around on its first orbit just as the Twenty-third Congress of the Communist Party of the Soviet Union was convening for its morning session. ",
    "Imglink": "images/1960-1969/Luna10.jpg"    },
{
    "Date": "August 1966",
    "Event": "First probe to map the Moon",
    "Country": " USA",
    "Name": "Lunar Orbiter 1",
    "Summary": "The Lunar Orbiter 1 spacecraft was designed primarily to photograph smooth areas of the lunar surface for selection and verification of safe landing sites for the Surveyor and Apollo missions. It was also equipped to collect selenodetic, radiation intensity, and micrometeoroid impact data.",
    "Imglink": "images/1960-1969/LunarOrbiter1.jpg"    },
{
    "Date": "30 October 1967",
    "Event": "First automated (crewless) docking",
    "Country": " USSR",
    "Name": "Cosmos 186/Cosmos 188",
    "Summary": "Cosmos 186 incorporated a re-entry body (capsule) for landing scientific instruments and test objects. Automatic mating of satellites in orbit was accomplished on October 30, 1967, by Cosmos 186 and Cosmos 188. Mutual search, approach, mooring, and docking were automatically performed. After 3.5 hr of joint flight, the satellites parted on a command sent from the earth and continued to orbit separately. On October 31, 1976, Cosmos 186 made a soft landing in a predetermined region of the USSR.",
    "Imglink": "images/1960-1969/Cosmos186.jpg"    },
{
    "Date": "September 1968",
    "Event": "First animals and plants to leave Earth orbit, to travel to and circle the Moon, and the first Moon mission with passengers to return safely to Earth",
    "Country": " USSR",
    "Name": "Zond 5",
    "Summary": "Zond 5 was launched from a Tyazheliy Sputnik (68-076B) in Earth parking orbit to make scientific studies during a lunar flyby and to return to Earth. It was announced that the turtles (steppe tortoises) had lost about 10% of their body weight but remained active and showed no loss of appetite. The spacecraft was planned as a precursor to crewed lunar spacecraft. It represented the first successful Soviet circumlunar Earth-return mission. ",
    "Imglink": "images/1960-1969/Zond5.jpg"    },
{
    "Date": "7 December 1968",
    "Event": "First orbital ultraviolet observatory",
    "Country": " USA (NASA)",
    "Name": "OAO-2",
    "Summary": "This spacecraft was one of a series of automated astronomical observatories that was ground controllable in orientation and was placed in a low-earth orbit. This spacecraft carried two experiment packages, which were located centrally within the spacecraft, each viewing space from opposite ends.",
    "Imglink": "images/1960-1969/Oao2.jpg"    },
{
    "Date": "21 December 1968",
    "Event": "First piloted orbital mission of another celestial body (Moon),  First Trans-Earth injection First human space mission to enter the gravitational influence of another celestial body (25 December)",
    "Country": " USA (NASA)",
    "Name": "Apollo 8",
    "Summary": "Apollo 8 launched on December 21, 1968, and was the second crewed spaceflight mission flown in the United States Apollo space program after Apollo 7, which stayed in Earth orbit. Apollo 8 took 68 hours (almost three days) to travel the distance to the Moon. The crew orbited the Moon ten times over the course of twenty hours, during which they made a Christmas Eve television broadcast in which they read the first ten verses from the Book of Genesis. At the time, the broadcast was the most watched TV program ever. Apollo 8's successful mission paved the way for Apollo 11 to fulfill U.S. president John F. Kennedy's goal of landing a man on the Moon before the end of the 1960s.",
    "Imglink": "images/1960-1969/Apollo8.jpg"    },
{
    "Date": "January 1969",
    "Event": "First docking between two crewed spacecraft in Earth orbit, also the first crew exchange in space",
    "Country": " USSR",
    "Name": "Soyuz 4 and Soyuz 5",
    "Summary": "Soyuz 5 was launched with a crew of three men -- Boris Volynov, Commander, Aleksey Yeliseyev, Flight Engineer, and Yevgeniy Khrunov, Research Engineer. It co-orbited with Soyuz 4, they both made orbital corrections, and then during the 34th orbit of Soyuz 4 and the 18th orbit of Soyuz 5, the automatic docking system brought the ships to within 99 m of one another. Cosmonaut Shatalov of Soyuz 4 completed the docking maneuver manually, and the two ships flew for 4 hr 35 min with completely interlocking controls, power, and telephones. During the 35th orbit of Soyuz 5, cosmonauts Khrunov and Yeliseyev passed into the orbital compartment of their ship, donned pressure suits, opened the outer hatch, and floated and used handrails to maneuver themselves to the opened hatch of Soyuz 4. Television cameras recorded the entire procudure both inside and outside the ships. The combined ships were hailed in Soviet announcements as the world's first space station.",
    "Imglink": "images/1960-1969/Soyuz45.jpg"    },
{
    "Date": "January 1969",
    "Event": "First to parachute in Venus's atmosphere, lost contact before landing.",
    "Country": " USSR",
    "Name": "Venera 5",
    "Summary": "The Venera 5 and Venera 6 spacecraft were of identical design and launched 5 days apart in January 1969. The spacecraft were designed to make in-situ measurements as they descended through the Venusian atmosphere. Measurements included temperature, pressure, composition ",
    "Imglink": "images/1960-1969/Venera5.jpg"    },
{
    "Date": "23 May 1969",
    "Event": "First docking of two crewed spacecraft around another celestial body.",
    "Country": " USA (NASA)",
    "Name": "Apollo 10",
    "Summary": "Apollo 10 (May 18–26, 1969) was a human spaceflight, the fourth crewed mission in the United States Apollo program, and the second (after Apollo 8) to orbit the Moon. It was the F mission: a \"dress rehearsal\" for the first Moon landing, testing all the components and procedures just short of actually landing. While astronaut John Young remained in the Command Module orbiting the Moon, astronauts Thomas Stafford and Gene Cernan flew the Apollo Lunar Module (LM) to a descent orbit within 8.4 nautical miles (15.6 km) of the lunar surface, the point where powered descent for landing would begin.[2] After orbiting the Moon 31 times,[3] Apollo 10 returned safely to Earth, and its success enabled the first actual landing (Apollo 11) two months later. ",
    "Imglink": "images/1960-1969/Apollo10.jpg"    },
{
    "Date": "20 July 1969",
    "Event": "First human on the Moon, and first space launch from a celestial body other than the EarthFirst sample return from the Moon.",
    "Country": " USA (NASA)",
    "Name": "Apollo 11",
    "Summary": "Apollo 11 (July 16–24, 1969) was the spaceflight that first landed humans on the Moon. Commander Neil Armstrong and lunar module pilot Buzz Aldrin formed the American crew that landed the Apollo Lunar Module Eagle on July 20, 1969, at 20:17 UTC (14:17 CST). Armstrong became the first person to step onto the lunar surface six hours and 39 minutes later on July 21 at 02:56 UTC; Aldrin joined him 19 minutes later. They spent about two and a quarter hours together outside the spacecraft, and collected 47.5 pounds (21.5 kg) of lunar material to bring back to Earth. Command module pilot Michael Collins flew the Command Module Columbia alone in lunar orbit while they were on the Moon's surface. Armstrong and Aldrin spent 21 hours, 36 minutes on the lunar surface, at a site they had named Tranquility Base upon landing, before lifting off to rejoin Columbia in lunar orbit.",
    "Imglink": "images/1960-1969/Apollo11.jpg"    },
{
    "Date": "August 4, 1969",
    "Event": "First photograph of Mars' moon Phobos from Space",
    "Country": " USA (NASA)",
    "Name": "Mariner 7",
    "Summary": "The Mariner 7 spacecraft made a close flyby of Mars just five days after its twin spacecraft, Mariner 6, in 1969. Although it had the same objective to study the surface and atmosphere of the Red Planet, Mariner 7 benefited from being the second to arrive at Mars. Scientists were able to use the spacecraft's reprogrammable command system to instruct it to take additional pictures of the Martian south pole, which had piqued their interest during Mariner 6's flyby. One photo even showed Mars' irregularly shaped moon, Phobos. ",
    "Imglink": "images/1960-1969/Mariner7.jpg"    },
{
    "Date": "19 November 1969",
    "Event": "First rendezvous on the surface of a celestial body",
    "Country": " USA (NASA)",
    "Name": "Apollo 12/Surveyor 3",
    "Summary": "Surveyor 3 was the third lander of the American uncrewed Surveyor program sent to explore the surface of the Moon in 1967. It was the first mission to carry a surface-soil sampling-scoop. Surveyor 3 was visited by Apollo 12 astronauts Pete Conrad and Alan Bean in November, 1969, and remains the only probe visited by humans on another world. The Apollo 12 astronauts excised several components of Surveyor 3, including the television camera, and returned them to Earth for study. ",
    "Imglink": "images/1960-1969/Apollo12.jpg"    }
]