const data=[
    {
      "Date": "12 April 1981",
      "Event": "First Reusable crewed orbital spacecraft",
      "Country": "USA (NASA)",
      "Name": "STS-1",
      "Summary": "STS-1 (Space Transportation System-1) was the first orbital spaceflight of NASA's Space Shuttle program. It orbited the Earth 36 times in 54.5 Hours and was one of the first spacecraft to carry a crew and it was also the first orbital spacecraft which was reusable."
     , "Imglink": "images/1981-1999/1.jpg"
    },
    {
      "Date": "1 March 1982",
      "Event": "First Venus soil samples and sound recording of another world",
      "Country": "USSR",
      "Name": "Venera 13",
     "Summary": "Venera 13 (In English meaning Venus 13) was a probe in the Soviet Venera program for the exploration of Venus. It transmitted the first recording of actual sounds from another planet which included sounds of Venusian wind, lander hitting the ground, pyrotechnic lens cap removal and its impact on regolith, and action of the regolith drilling apparatus."
     , "Imglink": "images/1981-1999/2.jpg"
    },
    {
      "Date": "19 August 1982",
      "Event": "First mixed gender crew aboard space station, and first woman on space station.",
      "Country": "USSR",
      "Name": "Salyut 7",
      
      "Summary": "Salyut 7 (English: Salute 7) was a space station in low Earth orbit for almost 9 years. It was first crewed in May 1982 with two crew via Soyuz T-5, and last visited in June 1986, by Soyuz T-15. Various crew and modules were used over its lifetime, including 12 crewed and 15 uncrewed launches in total.Supporting spacecraft included the Soyuz T, Progress, and TKS spacecraft."
      , "Imglink": "images/1981-1999/3.jpg"
    },
    {
      "Date": "25 January 1983",
      "Event": "First Infrared orbital observatory",
      "Country": "USA (NASA)  UK (SERC)  Netherlands (NIVR)",
      "Name": "IRAS",
     
      "Summary": "The Infrared Astronomical Satellite (IRAS) was the first-ever space telescope to perform a survey of the entire night sky at infrared wavelengths. Launched on 25 January 1983, its mission lasted ten months. The telescope was a joint project of the United States (NASA), the Netherlands (NIVR), and the United Kingdom (SERC). Over 250,000 infrared sources were observed at 12, 25, 60, and 100 micrometer wavelengths."
      , "Imglink": "images/1981-1999/IRAS.jpg"
    },
    {
      "Date": "13 June 1983",
      "Event": "First spacecraft beyond the orbit of Neptune (first spacecraft to pass beyond all Solar System planets)",
      "Country": "USA (NASA)",
      "Name": "Pioneer 10",
     
      "Summary": "Pioneer 10  is an American space probe, launched in 1972 and weighing 258 kilograms (569 pounds), that completed the first mission to the planet Jupiter. It was the first spacecraft to pass beyond all the planets of the solar system. During the mission, the on-board instruments were used to study the asteroid belt, the environment around Jupiter, the solar wind, cosmic rays, and eventually the far reaches of the Solar System and heliosphere"
      , "Imglink": "images/1981-1999/Pioneer10.jpg"
    },
    {
      "Date": "7 February 1984",
      "Event": "First untethered spacewalk, Bruce McCandless II",
      "Country": "USA (NASA)",
      "Name": "STS-41-B",
     
      "Summary": "STS-41-B was the tenth NASA Space Shuttle mission and the fourth flight of the Space Shuttle Challenger. It launched on February 3, 1984, and landed on February 11 after deploying two communications satellites. It was also notable for including the first untethered spacewalk."
      , "Imglink": "images/1981-1999/STS41B.jpg"
    },
    {
      "Date": "25 July 1984",
      "Event": "First spacewalk by woman, Svetlana Savitskaya",
      "Country": "USSR",
      "Name": "Salyut 7",
     
      "Summary": "Salyut 7 (English: Salute 7) was a space station in low Earth orbit from April 1982 to February 1991. It was crewed in June 1986, by Soyuz T-15. And this included the first women to be a crew in the mission and also becoming the first to perform spacewalk."
      , "Imglink": "images/1981-1999/Svetlana.jpg"
    },
    {
      "Date": "11 June 1985",
      "Event": "First balloon deployed on another planet (Venus)",
      "Country": "USSR",
      "Name": "Vega 1",
     
      "Summary": "Vega 1 is a Soviet space probe, part of the Vega program. The spacecraft was a development of the earlier Venera craft. The name VeGa (ВеГа) combines the first two letters from the Russian words for Venus. The craft was powered by twin large solar panels and instruments included an antenna dish, cameras, spectrometer, infrared sounder, magnetometers (MISCHA), and plasma probes. The spacecraft were also equipped with a dual bumper shield[2] for dust protection from Halley's comet."
      , "Imglink": "images/1981-1999/Vega1.jpg"
    },
    {
      "Date": "24 January 1986",
      "Event": "First Uranus flyby (closest approach 81,500 kilometers (44,000 nmi)",
      "Country": "USA (NASA)",
      "Name": "Voyager 2",
     
      "Summary": "Voyager 2 is a space probe launched by NASA on August 20, 1977, to study the outer planets and interstellar space beyond the Sun's heliosphere. A part of the Voyager program, it was launched 16 days before its twin, Voyager 1, on a trajectory that took longer to reach Jupiter and Saturn but enabled further encounters with Uranus and Neptune. It is the only spacecraft to have visited either of these two ice giant planets. Voyager 2 was the fourth of five spacecraft to achieve the Solar escape velocity, which allowed it to leave the Solar System."
      , "Imglink": "images/1981-1999/Voyager2.jpg"
    },
    {
      "Date": "28 January 1986",
      "Event": "First major American space loss, the Space Shuttle Challenger disaster, an explosion soon after liftoff which killed, among others, Christa McAuliffe, a high school teacher",
      "Country": "USA (NASA)",
      "Name": "STS-51-L",
     
      "Summary": "STS-51-L was the disastrous 25th mission of the United States Space Shuttle program, the program to carry out routine transportation for Earth-to-orbit crew and cargo; as well as the final flight of Space Shuttle Challenger. Planned as the first Teacher in Space Project in addition to observing Halley's Comet for six days, the mission never achieved orbit; a structural failure during its ascent phase 73 seconds after launch from Kennedy Space Center Launch Complex 39B killed all seven crew members."
      , "Imglink": "images/1981-1999/STS51L.jpg"
    },
    {
      "Date": "19 February 1986",
      "Event": "First consistently inhabited long-term research space station",
      "Country": "USSR",
      "Name": "Mir",
     
      "Summary": "Mir was a space station that operated in low Earth orbit from 1986 to 2001, operated by the Soviet Union and later by Russia. Mir was the first modular space station and was assembled in orbit from 1986 to 1996. It had a greater mass than any previous spacecraft. Mir was the first continuously inhabited long-term research station in orbit and held the record for the longest continuous human presence in space at 3,644 days"
      , "Imglink": "images/1981-1999/MIR.jpg"
    },
    {
      "Date": "4 March 1986",
      "Event": "First flyby of a comet (Halley's Comet, 8,889 kilometers)",
      "Country": "USSR",
      "Name": "Vega 1 & Vega 2",
     
      "Summary": "Vega 2 (along with Vega 1) was a Soviet space probe part of the Vega program to explore Halley's comet and Venus. The spacecraft was a development of the earlier Venera craft. It was a first flyby of a comet i.e the Halley's Comet.The spacecraft were equipped with a dual bumper shield for dust protection from Halley's Comet."
      , "Imglink": "images/1981-1999/Vega1.jpg"
    },
    {
      "Date": "13 March 1986",
      "Event": "First close up observations of a comet (Halley's Comet, 596 kilometers)",
      "Country": "ESA",
      "Name": "Giotto",
     
      "Summary": "Giotto was a European robotic spacecraft mission from the European Space Agency. The spacecraft flew by and studied Halley's Comet and in doing so became the first spacecraft to make close up observations of a comet. On 13 March 1986, the spacecraft succeeded in approaching Halley's nucleus at a distance of 596 kilometers. It was named after the Early Italian Renaissance painter Giotto di Bondone."
      , "Imglink": "images/1981-1999/Giotto.jpg"
    },
    {
      "Date": "July 1988",
      "Event": "First suspected detection of an exoplanet Gamma Cephei Ab, although the discovery was retracted in 1994, and not confirmed until 2002.",
      "Country": "Canada",
      "Name": "Team of astronomers, led by Bruce Campbell, Gordon Walker, and Stephenson Yang; existence announced by Anthony Lawton & P. Wright in 1989",
     
      "Summary": "Team of astronomers, led by Bruce Campbell, Gordon Walker, and Stephenson Yang sespected the existence of first discovered exoplanet Gamma Cephai Ab, it was announced by Anthony Lawton & P. Wright in 1989 and later the discovery was confirmed in 2002."
      , "Imglink": "images/1981-1999/exo2.jpg"
    },
    {
      "Date": "8 August 1989",
      "Event": "First astrometric satellite",
      "Country": "ESA",
      "Name": "Hipparcos",
     
      "Summary": "Hipparcos was a scientific satellite of the European Space Agency (ESA), launched in 1989 and operated until 1993. It was the first space experiment devoted to precision astrometry, the accurate measurement of the positions of celestial objects on the sky.  This permitted the first high-precision measurements of the intrinsic brightnesses, proper motions and parallaxes of stars, enabling better calculations of their distance and tangential velocity."
      , "Imglink": "images/1981-1999/Hipparcos.jpg"
    },
    {
      "Date": "25 August 1989",
      "Event": "First Neptune flyby (closest approach at 29,240 km)",
      "Country": "USA (NASA)",
      "Name": "Voyager 2",
     
      "Summary": "This time, Voyager 2 took the first Neptune flyby"
      , "Imglink": "images/1981-1999/Voyager2.jpg"
    },
    {
      "Date": "18 November 1989",
      "Event": "First orbital cosmic microwave observatory",
      "Country": "USA (NASA)",
      "Name": "COBE",
     
      "Summary": "The Cosmic Background Explorer (COBE), also referred to as Explorer 66, was a satellite dedicated to cosmology, which operated from 1989 to 1993. Its goals were to investigate the cosmic microwave background radiation (CMB) of the universe and provide measurements that would help shape our understanding of the cosmos. COBE's measurements provided two key pieces of evidence that supported the Big Bang theory of the universe."
      , "Imglink": "images/1981-1999/COBE.jpg"
    },
    {
      "Date": "14 February 1990",
      "Event": "First photograph of the whole Solar System",
      "Country": "USA (NASA)",
      "Name": "Voyager 1",
     
      "Summary": "Voyager 1 is a space probe launched by NASA as part of the Voyager program to study the outer Solar System and interstellar space beyond the Sun's heliosphere. Voyager 1 studied the weather, magnetic fields, and rings of the two planets, and was the first probe to provide detailed images of their moons. On Februay 1990, Voyager 1 took first photograph of the whole solar system."
      , "Imglink": "images/1981-1999/Voyager1.jpg"
    },
    {
      "Date": "24 April 1990",
      "Event": "Optical orbital observatory",
      "Country": "USA (NASA)  ESA",
      "Name": "Hubble Space Telescope",
     
      "Summary": "The Hubble Space Telescope is a space telescope that was launched into low Earth orbit in 1990 and remains in operation. It was not the first space telescope, but it is one of the largest and most versatile, renowned both as a vital research tool and as a public relations boon for astronomy."
      , "Imglink": "images/1981-1999/HubbleSpaceTelescope.jpg"
    },
    {
      "Date": "2 July 1990",
      "Event": "First time a spacecraft coming from deep space uses the Earth for a gravity-assist manoeuvre",
      "Country": "ESA",
      "Name": "Giotto",
     
      "Summary": "Giotto was a European robotic spacecraft mission from the European Space Agency. Giotto was commanded to wake up on 2 July 1990 when it flew by Earth in order to sling shot to its next cometary encounter.This was the first time a spacecraftcoming from deep space using the Earth for a gravity-assist manoeuvre."
      , "Imglink": "images/1981-1999/Giotto.jpg"
    },
    {
      "Date": "15 September 1990",
      "Event": "Extended (multi-year) orbital exploration of Venus",
      "Country": "USA (NASA)",
      "Name": "Magellan",
     
      "Summary": "The Magellan spacecraft was a 1,035-kilogram (2,282 lb) robotic space probe launched by NASA of the United States to map the surface of Venus by using synthetic-aperture radar and to measure the planetary gravitational field. The Magellan probe was the first interplanetary mission to be launched from the Space Shuttle, the first one to use the Inertial Upper Stage booster, and the first spacecraft to test aerobraking as a method for circularizing its orbit."
      , "Imglink": "images/1981-1999/Mangellan.jpg"
    },
    {
      "Date": "21 October 1991",
      "Event": "First asteroid flyby (951 Gaspra closest approach 1,600 kilometers)",
      "Country": "USA (NASA)",
      "Name": "Galileo",
     
      "Summary": "Galileo was an American robotic space probe that studied the planet Jupiter and its moons, as well as several other Solar System bodies. Named after the Italian astronomer Galileo Galilei, it consisted of an orbiter and an entry probe. It arrived at Jupiter after gravitational assist flybys of Venus and Earth, and became the first spacecraft to orbit Jupiter."
      , "Imglink": "images/1981-1999/Galileo.jpg"
    },
    {
      "Date": 1992,
      "Event": "First confirmed observation of an exoplanet",
      "Country": "Canada  Poland",
      "Name": "Aleksander Wolszczan & Dale Frail",
     
      "Summary": "Aleksander Wolszczan & Dale Frail in 1992 retracted the discovery of exoplanet Gamma Cephei Ab which was the first to be detected as an exoplanet."
      , "Imglink": "images/1981-1999/exoplanet.jpg"
    },
    {
      "Date": "8 February 1992",
      "Event": "First polar orbit around the Sun",
      "Country": "USA (NASA)  ESA",
      "Name": "Ulysses",
     
      "Summary": "Ulysses is a decommissioned robotic space probe whose primary mission was to orbit the Sun and study it at all latitudes. It was launched in 1990 and made three \"fast latitude scans\" of the Sun in 1994/1995, 2000/2001, and 2007/2008. In addition, the probe studied several comets. Ulysses was a joint venture of NASA and the European Space Agency (ESA) under leadership of ESA with participation from Canada's National Research Council."
      , "Imglink": "images/1981-1999/Ulysses.jpg"
    },
    {
      "Date": "22 March 1995",
      "Event": "Record longest duration spaceflight (437.7 days) set by Valeri Polyakov",
      "Country": "Russia (FKA)",
      "Name": "Mir",
     
      "Summary": "Mir was the first continuously inhabited long-term research station in orbit and held the record for the longest continuous human presence in space at 3,644 days, until it was surpassed by the ISS on 23 October 2010. It holds the record for the longest single human spaceflight, with Valeri Polyakov spending 437 days and 18 hours on the station between 1994 and 1995."
      , "Imglink": "images/1981-1999/MIR.jpg"
    },
    {
      "Date": "7 December 1995",
      "Event": "First orbit of Jupiter",
      "Country": "USA (NASA)",
      "Name": "Galileo",
     
      "Summary": "Galileo was an American robotic space probe that studied the planet Jupiter and its moons, as well as several other Solar System bodies. Galileo arrived at Jupiter on December 7, 1995, after gravitational assist flybys of Venus and Earth, and became the first spacecraft to orbit Jupiter."
      , "Imglink": "images/1981-1999/Galileo.jpg"
    },
    {
      "Date": "7 December 1995",
      "Event": "First mission into the atmosphere of a gas giant (Jupiter)",
      "Country": "USA (NASA)",
      "Name": "Galileo's atmospheric entry probe",
     
      "Summary": "Galileo entered the atmosphere of a gas giant Jupiter which was first when it happened."
      , "Imglink": "images/1981-1999/Galileo.jpg"
    },
    {
      "Date": "12 February 1997",
      "Event": "First orbital radio observatory",
      "Country": "Japan (ISAS)",
      "Name": "HALCA",
     
      "Summary": "HALCA (Highly Advanced Laboratory for Communications and Astronomy) was a Japanese 8 meter diameter radio telescope satellite which was used for Very Long Baseline Interferometry (VLBI). It was the first such space-borne dedicated VLBI mission."
      , "Imglink": "images/1981-1999/HALCA.jpg"
    },
    {
      "Date": "4 July 1997",
      "Event": "First operational rover on another planet (Mars)",
      "Country": "USA (NASA)",
      "Name": "Mars Pathfinder",
     
      "Summary": "Mars Pathfinder (MESUR Pathfinder) is an American robotic spacecraft that landed a base station with a roving probe on Mars in 1997. It consisted of a lander, renamed the Carl Sagan Memorial Station, and a lightweight (10.6 kg/23 lb) wheeled robotic Mars rover named Sojourner, which became the first rover to operate outside the Earth–Moon system."
      , "Imglink": "images/1981-1999/MarsPathfinder.jpg"
    },
    {
      "Date": "20 November 1998",
      "Event": "First multinational space station,  Largest artificial object built in space to date",
      "Country": "Russia (FKA)  USA (NASA)  Europe (ESA)  Japan (JAXA)  Canada (CSA)",
      "Name": "International Space Station",
     
      "Summary": "The International Space Station (ISS) is a modular space station (habitable artificial satellite) in low Earth orbit. It is a multinational collaborative project involving five participating space agencies: NASA (United States), Roscosmos (Russia), JAXA (Japan), ESA (Europe), and CSA (Canada). The station serves as a microgravity and space environment research laboratory in which scientific research is conducted in astrobiology, astronomy, meteorology, physics, and other fields."
      , "Imglink": "images/1981-1999/InternationalSpaceStation.jpg"
    }
  ];